<?php
use App\Http\Controllers\BotManController;
use App\Conversations\ButtonConversation;
use BotMan\BotMan\Messages\Outgoing\Actions\Button;

$botman = resolve('botman');

$botman->hears('/start', function ($bot) {
    $bot->startConversation(new ButtonConversation());
});




//

//$botman->group(['driver' => [\BotMan\Drivers\Telegram\TelegramDriver::class]], function($bot) {
//
//
//
//
////$botman->hears('Start conversation', BotManController::class.'@startConversation');
//
////$botman->hears('/help', function($bot){
////    $bot->reply('');
////})->skipsConversation();
////$botman->hears('/back', function($bot) {
////    $bot->typesAndWaits(0);
////    $bot->reply('');
////    $keyboard = [
////        ['📩Хабар юбориш.'],
////    ];
////    $bot->typesAndWaits(0);
////
////    $bot->reply("Бўлимни танланг!", ['reply_markup' => json_encode([
////        'keyboard' => $keyboard,
////        'one_time_keyboard' => true,
////        'resize_keyboard' => true
////    ])]);
////});//->stopsConversation();
////$botman->hears('/bot', ButtonConversation::class.'@startConversation');
//
////$botman->hears('information', function($bot){
////    $user = $bot->getUser();
////
////    $bot->reply('ID:'.$user->getId());
////    $bot->reply('Firstname:'.$user->getFirstName());
////    $bot->reply('Lastname:'.$user->getLastName());
////    $bot->reply('Username:'.$user->getUserName());
////    $bot->reply('Info:'.print_r($user->getInfo(),true));
////});
//
//// Bot boshlanishi
//$botman->hears('/start', function($bot){
//
//    $keyboard = [
//        ['🇺🇿 uzbek'],
//        ['🇷🇺 русский'],
//    ];
//    $bot->reply("tilni tanlang!",['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//
//$botman->hears('(.*)uzbek',function ($bot) {
//    $keyboard = [
//        ['Вилоятлар'],
//        ['Тузилмалар'],
//        ['Universitetlar'],
//    ];
//    $bot->typesAndWaits(0);
//    $bot->reply('🗣 Хурматли фуқоролар Қишлоқ хўжалиги вазирлиги тизимида коррупцияга дуч келсангиз, бизга хабар беринг.
//
//        🤳Қишлоқ хўжалиги вазирлиги тизимидаги, жумладан, қишлоқ хўжалиги бошқармалари ва бўлимлари,вазирлик тизимидаги корхоналар, ташкилотлар ва таълим муассасаларидаги коррупция ҳолатлари ҳақида маълумотларни телеграмдаги @UzAgroAnticorruptionBot ботига ва  +998 71 206-70-65 вазирликнинг ишонч телефонига хабар қилиш орқали юборишингиз мумкин.
//
//        ‼️Юборилган хабарлар белгиланган тартибда кўриб чиқилади ҳамда мурожаат қилувчининг шахси сир сақланиши кафолатланади.');
//
//
//
//
//    $bot->reply("Бўлимни танланг! ", ['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//
//$botman->hears('(.*)русский',function ($bot) {
//    $keyboard = [
//        ['Провинции'],
//        ['Структуры'],
//        ['Университеты'],
//    ];
//
//    $bot->typesAndWaits(0);
//    $bot->reply('🗣 Уважаемые граждане! Если вы столкнетесь с коррупцией в системе Минсельхоза, сообщите нам об этом.
//
//        🤳 Информацию о коррупции в системе Минсельхоза, в том числе сельскохозяйственных ведомствах и отделах, предприятиях, организациях и образовательных учреждениях в системе министерства, можно отправить боту @UzAgroAnticorruptionBot в телеграмме и на горячую линию министерства +998 71 206-70-65.
//
//        ‼ ️Отправленные сообщения будут рассмотрены в установленном порядке, и конфиденциальность заявителя будет гарантирована.');
//
//
//
//
//    $bot->reply("Выберите раздел! ", ['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//
//
//
//
//
//$botman->hears('Вилоятлар', function($bot){
//    $bot->typesAndWaits(0);
//    $bot->reply('');
//    $keyboard = [
//        ['Андижон вилояти'],
//        ['Бухоро вилояти'],
//        ['Жиззах вилояти'],
//        ['Қашқадарё вилояти'],
//        ['Қорақалпоғистон Республикаси'],
//        ['Навоий вилояти'],
//        ['Наманган вилояти'],
//        ['Самарқанд вилояти'],
//        ['Сирдарё вилояти'],
//        ['Сурхондарё вилояти'],
//        ['Тошкент вилояти'],
//        ['Фаргона вилояти'],
//        ['Хоразм вилояти'],
//    ];
//    $bot->typesAndWaits(0);
//
//    $bot->reply("Керакли вилоят танланг!", ['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//
//$botman->hears('провинции', function($bot){
//    $bot->typesAndWaits(0);
//    $bot->reply('');
//    $keyboard = [
//        ['Андижанская область'],
//        ['Бухарская область'],
//        ['Джизакская область'],
//        ['Кашкадарьинская область'],
//        ['Республика Каракалпакстан'],
//        ['Навоийская область'],
//        ['Наманганская область'],
//        ['Самаркандская область'],
//        ['Сырдарьинская область'],
//        ['Сурхандарьинская область'],
//        ['Ташкентская область'],
//        ['Ферганская область'],
//        ['Хорезмская область'],
//    ];
//    $bot->typesAndWaits(0);
//
//    $bot->reply("Выберите желаемый регион!", ['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//
//$botman->hears('Тузилмалар', function($bot){
//    $bot->typesAndWaits(0);
//    $bot->reply('');
//    $keyboard = [
//        ['Ўзбекистон Республикаси қишлоқ хўжалиги вазирлиги'],
//        ['Қорақалпоғистон Республикаси қишлоқ хўжалиги вазирлиги'],
//        ['Андижон вилояти қишлоқ хўжалиги бошқармаси'],
//        ['Фарғона вилояти қишлоқ хўжалиги бошқармаси'],
//        ['Жиззах вилояти қишлоқ хўжалиги бошқармаси'],
//        ['Хоразм вилояти қишлоқ хўжалиги бошқармаси'],
//        ['Наманган вилояти қишлоқ хўжалиги бошқармаси'],
//        ['Навоий вилояти қишлоқ хўжалиги бошқармаси'],
//        ['Қашқадарё вилояти қишлоқ хўжалиги бошқармаси'],
//        ['Самарқанд вилояти қишлоқ хўжалиги бошқармаси'],
//        ['Сирдарё вилояти қишлоқ хўжалиги бошқармаси'],
//        ['Сурхондарё вилояти қишлоқ хўжалиги бошқармаси'],
//        ['Тошкент вилояти қишлоқ хўжалиги бошқармаси'],
//        ['"Ўздаверлойиҳа" илмий-лойиҳалаш институти'],
//        ['"Академик М.Мирзаев номидаги боғдорчилик, узумчилик
//            ва виночилик илмий-тадқиқот институти"'],
//        ['Боғдорчилик ва иссиқхона хўжалигини ривожлантириш агентлиги'],
//        ['Қишлоқ хўжалигида билим ва инновациялар миллий маркази'],
//        ['Уруғчиликни ривожлантириш маркази'],
//        ['Қишлоқ хўжалиги экинлари навларини синаш маркази'],
//        ['Тупроқ таркиби ва репозиторийси, сифати таҳлил маркази'],
//        ['Қишлоқ хўжалиги техникаси ва технологияларини сертификатлаш ва синаш давлат маркази'],
//        ['Қишлоқ хўжалигини стандартлаштириш маркази'],
//        ['Кимёлаштириш ва ўсимликларни ҳимоя қилиш воситаларини синовдан ўтказиш ва рўйхатга олиш бўйича давлат комиссияси Ишчи органи'],
//        ['Тошкент давлат аграр университети'],
//        ['Андижон қишлоқ хўжалиги ва агротехнологиялар институти'],
//        ['Маъмурий-хўжалик хизмати муассасаси'],
//        ['Агросаноатни рақамлаштириш маркази'],
//    ];
//    $bot->typesAndWaits(0);
//
//    $bot->reply("Керакли тузилмани танланг!", ['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//
//$botman->hears('Структуры', function($bot){
//    $bot->typesAndWaits(0);
//    $bot->reply('');
//    $keyboard = [
//        ['Министерство сельского хозяйства Республики Узбекистан'],
//        ['Министерство сельского хозяйства Республики Каракалпакстан'],
//        ['Андижанское областное управление сельского хозяйства'],
//        ['Управление сельского хозяйства Ферганской области'],
//        ['Управление сельского хозяйства Джизакской области'],
//        ['Хорезмское областное управление сельского хозяйства'],
//        ['Наманганское областное управление сельского хозяйства'],
//        ['Навоийское областное управление сельского хозяйства'],
//        ['Управление сельского хозяйства Кашкадарьинской области'],
//        ['Управление сельского хозяйства Самаркандской области'],
//        ['Сырдарьинское областное управление сельского хозяйства'],
//        ['Управление сельского хозяйства Сурхандарьинской области'],
//        ['Управление сельского хозяйства Ташкентской области'],
//        ['"Уздаверлойиха Научно-исследовательский и проектный институт'],
//        ['"Садоводство и виноградарство имени академика М. Мирзаева.
//             и винодельческий научно-исследовательский институт"'],
//        ['Агентство развития садоводства и теплиц'],
//        ['Национальный центр знаний и инноваций в сельском хозяйстве'],
//        ['Центр развития семян'],
//        ['Центр испытаний сортов сельскохозяйственных культур'],
//        ['Состав и хранилище почв, центр анализа качества'],
//        ['Государственный центр сертификации и испытаний сельскохозяйственной техники и технологий'],
//        ['Центр стандартизации сельского хозяйства'],
//        ['Рабочий орган Государственной комиссии по испытаниям и регистрации химических веществ и средств защиты растений'],
//        ['Ташкентский Государственный Аграрный Университет'],
//        ['Андижанский институт сельского хозяйства и агротехнологии'],
//        ['Учреждение административно-хозяйственного обслуживания'],
//        ['Центр агропромышленной цифровизации'],
//    ];
//    $bot->typesAndWaits(0);
//
//    $bot->reply("Выберите желаемую структуру!", ['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//
//$botman->hears('Агросаноатни рақамлаштириш маркази|Маъмурий-хўжалик хизмати муассасаси|Андижон қишлоқ хўжалиги ва агротехнологиялар институти|Тошкент давлат аграр университети|Кимёлаштириш ва ўсимликларни ҳимоя қилиш воситаларини синовдан ўтказиш ва рўйхатга олиш бўйича давлат комиссияси Ишчи органи|Қишлоқ хўжалигини стандартлаштириш маркази|Қишлоқ хўжалиги техникаси ва технологияларини сертификатлаш ва синаш давлат маркази|Тупроқ таркиби ва репозиторийси, сифати таҳлил маркази|Қишлоқ хўжалиги экинлари навларини синаш маркази|Уруғчиликни ривожлантириш маркази|Қишлоқ хўжалигида билим ва инновациялар миллий маркази|Боғдорчилик ва иссиқхона хўжалигини ривожлантириш агентлиги|"Академик М.Мирзаев номидаги боғдорчилик, узумчилик
//    ва виночилик илмий-тадқиқот институти"|"Ўздаверлойиҳа" илмий-лойиҳалаш институти|Тошкент вилояти қишлоқ хўжалиги бошқармаси|Сурхондарё вилояти қишлоқ хўжалиги бошқармаси|Сирдарё вилояти қишлоқ хўжалиги бошқармаси|Самарқанд вилояти қишлоқ хўжалиги бошқармаси|Қашқадарё вилояти қишлоқ хўжалиги бошқармаси|Навоий вилояти қишлоқ хўжалиги бошқармаси|Наманган вилояти қишлоқ хўжалиги бошқармаси|Хоразм вилояти қишлоқ хўжалиги бошқармаси|Жиззах вилояти қишлоқ хўжалиги бошқармаси|Фарғона вилояти қишлоқ хўжалиги бошқармаси|Андижон вилояти қишлоқ хўжалиги бошқармаси|Ўзбекистон Республикаси қишлоқ хўжалиги вазирлиги|Қорақалпоғистон Республикаси қишлоқ хўжалиги вазирлиги', function($bot){
//    $bot->typesAndWaits(0);
//    $bot->reply('');
//    $keyboard = [
//        ['Якунлаш'],
//    ];
//    $bot->typesAndWaits(0);
//
//    $bot->reply("Сизда ушбу йўналишга оид қандайдир маълумот (видео/аудио/фото/в.х.) бўлса, илова қилган ҳолда бизга юборишингиз мумкин!", ['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//
//$botman->hears('Universitetlar', function($bot){
//    $bot->typesAndWaits(0);
//    $bot->reply('');
//    $keyboard = [
//        ['Агросаноатни рақамлаштириш маркази'],
//        ['Маъмурий-хўжалик хизмати муассасаси'],
//        ['Андижон қишлоқ хўжалиги ва агротехнологиялар институти'],
//        ['Тошкент давлат аграр университети|Кимёлаштириш ва ўсимликларни ҳимоя қилиш воситаларини синовдан ўтказиш ва рўйхатга олиш бўйича давлат комиссияси Ишчи органи'],
//        ['Кимёлаштириш ва ўсимликларни ҳимоя қилиш воситаларини синовдан ўтказиш ва рўйхатга олиш бўйича давлат комиссияси Ишчи органи'],
//        ['Қишлоқ хўжалигини стандартлаштириш марка'],
//        ['Қишлоқ хўжалиги техникаси ва технологияларини сертификатлаш ва синаш давлат маркази'],
//        ['Тупроқ таркиби ва репозиторийси, сифати таҳлил маркази'],
//        ['Қишлоқ хўжалиги экинлари навларини синаш маркази'],
//        ['Уруғчиликни ривожлантириш маркази'],
//        ['Қишлоқ хўжалигида билим ва инновациялар миллий маркази'],
//        ['Боғдорчилик ва иссиқхона хўжалигини ривожлантириш агентлиги'],
//        ['Академик М.Мирзаев номидаги боғдорчилик, узумчилик
//    ва виночилик илмий-тадқиқот институти'],
//        ['"Ўздаверлойиҳа" илмий-лойиҳалаш институти|Тошкент вилояти қишлоқ хўжалиги бошқармаси'],
//        ['Сурхондарё вилояти қишлоқ хўжалиги бошқармаси'],
//        ['Сирдарё вилояти қишлоқ хўжалиги бошқармаси'],
//        ['Самарқанд вилояти қишлоқ хўжалиги бошқармаси'],
//        ['Қашқадарё вилояти қишлоқ хўжалиги бошқармаси'],
//        ['Навоий вилояти қишлоқ хўжалиги бошқармаси'],
//        ['Наманган вилояти қишлоқ хўжалиги бошқармаси'],
//        ['Хоразм вилояти қишлоқ хўжалиги бошқармаси'],
//        ['Жиззах вилояти қишлоқ хўжалиги бошқармаси'],
//        ['Фарғона вилояти қишлоқ хўжалиги бошқармаси'],
//        ['Андижон вилояти қишлоқ хўжалиги бошқармаси'],
//        ['Ўзбекистон Республикаси қишлоқ хўжалиги вазирлиги'],
//        ['Қорақалпоғистон Республикаси қишлоқ хўжалиги вазирлиги'],
//    ];
//    $bot->typesAndWaits(0);
//
//    $bot->reply("Bo'limni tanlang! ", ['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//
//$botman->hears('Университеты', function($bot){
//    $bot->typesAndWaits(0);
//    $bot->reply('');
//    $keyboard = [
//        ['Центр агропромышленной цифровизации'],
//        ['Учреждение административно-хозяйственного обслуживания'],
//        ['Андижанский институт сельского хозяйства и агротехнологии'],
//        ['Ташкентский Государственный Аграрный Университет'],
//        ['Рабочий орган Государственной комиссии по испытаниям и регистрации химических веществ и средств защиты растений'],
//        ['Центр стандартизации сельского хозяйства'],
//        ['Государственный центр сертификации и испытаний сельскохозяйственной техники и технологий'],
//        ['Состав и хранилище почв, центр анализа качества'],
//        ['Центр испытаний сортов сельскохозяйственных культур'],
//        ['Центр развития семян'],
//        ['Национальный центр знаний и инноваций в сельском хозяйстве'],
//        ['Агентство развития садоводства и теплиц'],
//        ['Садоводство и виноградарство имени академика М. Мирзаева. и винодельческий научно-исследовательский институт'],
//        ['Уздаверлойиха Научно-исследовательский и проектный институт'],
//        ['Ташкентское областное управление сельского хозяйства'],
//        ['Управление сельского хозяйства Сурхандарьинской области'],
//        ['Сырдарьинское областное управление сельского хозяйства'],
//        ['Управление сельского хозяйства Самаркандской области'],
//        ['Управление сельского хозяйства Кашкадарьинской области'],
//        ['Навоийское областное управление сельского хозяйства'],
//        ['Наманганское областное управление сельского хозяйства'],
//        ['Хорезмское областное управление сельского хозяйства'],
//        ['Управление сельского хозяйства Джизакской области'],
//        ['Управление сельского хозяйства Ферганской области'],
//        ['Андижанское областное управление сельского хозяйства'],
//        ['Министерство сельского хозяйства Республики Узбекистан'],
//        ['Министерство сельского хозяйства Республики Каракалпакстан'],
//    ];
//    $bot->typesAndWaits(0);
//
//    $bot->reply("Выберите раздел! ", ['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//
//$botman->hears('Центр агропромышленной цифровизации|Учреждение административно-хозяйственного обслуживания|Андижанский институт сельского хозяйства и агротехнологии|Ташкентский Государственный Аграрный Университет|Рабочий орган Государственной комиссии по испытаниям и регистрации химических веществ и средств защиты растений|Центр стандартизации сельского хозяйства|Государственный центр сертификации и испытаний сельскохозяйственной техники и технологий|Состав и хранилище почв, центр анализа качества|Центр испытаний сортов сельскохозяйственных культур|Центр развития семян |Национальный центр знаний и инноваций в сельском хозяйстве|Агентство развития садоводства и теплиц|Садоводство и виноградарство имени академика М. Мирзаева. и винодельческий научно-исследовательский институт|Уздаверлойиха Научно-исследовательский и проектный институт|Ташкентское областное управление сельского хозяйства|Управление сельского хозяйства Сурхандарьинской области|Сырдарьинское областное управление сельского хозяйства|Управление сельского хозяйства Самаркандской области|Управление сельского хозяйства Кашкадарьинской области|Навоийское областное управление сельского хозяйства|Наманганское областное управление сельского хозяйства|Хорезмское областное управление сельского хозяйства|Управление сельского хозяйства Джизакской области|Управление сельского хозяйства Ферганской области|Андижанское областное управление сельского хозяйства|Министерство сельского хозяйства Республики Узбекистан|Министерство сельского хозяйства Республики Каракалпакстан', function($bot){
//    $bot->typesAndWaits(0);
//    $bot->reply('');
//    $keyboard = [
//        ['Завершение'],
//    ];
//    $bot->typesAndWaits(0);
//
//    $bot->reply("Если у вас есть какая-либо информация по этому направлению (видео / аудио / фото / и т. Д.), Вы можете прислать ее нам с приложением.!", ['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//
//$botman->hears('Агросаноатни рақамлаштириш маркази|Маъмурий-хўжалик хизмати муассасаси|Андижон қишлоқ хўжалиги ва агротехнологиялар институти|Тошкент давлат аграр университети|Кимёлаштириш ва ўсимликларни ҳимоя қилиш воситаларини синовдан ўтказиш ва рўйхатга олиш бўйича давлат комиссияси Ишчи органи|Қишлоқ хўжалигини стандартлаштириш маркази|Қишлоқ хўжалиги техникаси ва технологияларини сертификатлаш ва синаш давлат маркази|Тупроқ таркиби ва репозиторийси, сифати таҳлил маркази|Қишлоқ хўжалиги экинлари навларини синаш маркази|Уруғчиликни ривожлантириш маркази |Қишлоқ хўжалигида билим ва инновациялар миллий маркази|Боғдорчилик ва иссиқхона хўжалигини ривожлантириш агентлиги|Академик М.Мирзаев номидаги боғдорчилик, узумчилик
//    ва виночилик илмий-тадқиқот институти|"Ўздаверлойиҳа" илмий-лойиҳалаш институти|Тошкент вилояти қишлоқ хўжалиги бошқармаси|Сурхондарё вилояти қишлоқ хўжалиги бошқармаси|Сирдарё вилояти қишлоқ хўжалиги бошқармаси|Самарқанд вилояти қишлоқ хўжалиги бошқармаси|Қашқадарё вилояти қишлоқ хўжалиги бошқармаси|Навоий вилояти қишлоқ хўжалиги бошқармаси|Наманган вилояти қишлоқ хўжалиги бошқармаси|Хоразм вилояти қишлоқ хўжалиги бошқармаси|Жиззах вилояти қишлоқ хўжалиги бошқармаси|Фарғона вилояти қишлоқ хўжалиги бошқармаси|Андижон вилояти қишлоқ хўжалиги бошқармаси|Ўзбекистон Республикаси қишлоқ хўжалиги вазирлиги|Қорақалпоғистон Республикаси қишлоқ хўжалиги вазирлиги', function($bot){
//    $bot->typesAndWaits(0);
//    $bot->reply('');
//    $keyboard = [
//        ['Якунлаш'],
//    ];
//    $bot->typesAndWaits(0);
//
//    $bot->reply("Сизда ушбу йўналишга оид қандайдир маълумот (видео/аудио/фото/в.х.) бўлса, илова қилган ҳолда бизга юборишингиз мумкин!", ['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//
//
//
//$botman->hears('Хоразм вилояти|Фаргона вилояти|Тошкент вилояти|Сурхондарё вилоятиСирдарё вилояти|Самарқанд вилояти|Наманган вилояти|Андижон вилояти|Бухоро вилояти|Жиззах вилояти|Қашқадарё вилояти|Қорақалпоғистон Республикаси|Навоий вилояти', function($bot){
//    $bot->typesAndWaits(0);
//    $bot->reply('');
//    $keyboard = [
//        ['О продовольственной безопасности'],
//       ['О несвоевременном выполнении агротехнических мероприятий'],
//        ['Об использовании минеральных и органических удобрений'],
//        ['Об использовании земель сельскохозяйственного назначения'],
//        ['Дисциплина коктейлей'],
//        ['О финансово-хозяйственной деятельности'],
//         ['О государственных закупках (закупках товаров, работ, услуг)'],
//        ['О дисциплине и принудительном исполнении'],
//        ['В других направлениях'],
//    ];
//    $bot->typesAndWaits(0);
//
//    $bot->reply("Керакли йўналишни танланг!", ['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//
//
//$botman->hears('Озиқ-овқат хавсизлиги бўйича', function($bot){
//    $bot->typesAndWaits(0);
//    $bot->reply('');
//    $keyboard = [
//        ['Якунлаш'],
//    ];
//    $bot->typesAndWaits(0);
//
//    $bot->reply("Сизда ушбу йўналишга оид қандайдир маълумот (видео/аудио/фото/в.х.) бўлса, илова қилган ҳолда бизга юборишингиз мумкин!", ['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//
//$botman->hears('Агротехник тадбирларни ўз вақтида ўтказмаслик бўйича', function($bot){
//    $bot->typesAndWaits(0);
//    $bot->reply('');
//    $keyboard = [
//        ['Якунлаш'],
//    ];
//    $bot->typesAndWaits(0);
//
//    $bot->reply("Сизда ушбу йўналишга оид қандайдир маълумот (видео/аудио/фото/в.х.) бўлса, илова қилган ҳолда бизга юборишингиз мумкин!", ['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//
//$botman->hears('Минерал ва органик ўғитлардан фойдаланиш бўйича', function($bot){
//    $bot->typesAndWaits(0);
//    $bot->reply('');
//    $keyboard = [
//        ['Якунлаш'],
//    ];
//    $bot->typesAndWaits(0);
//
//    $bot->reply("Сизда ушбу йўналишга оид қандайдир маълумот (видео/аудио/фото/в.х.) бўлса, илова қилган ҳолда бизга юборишингиз мумкин!", ['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//
//$botman->hears('Қишлоқ хўжалигига мўлжалланган ерлардан фойдаланиш бўйича', function($bot){
//    $bot->typesAndWaits(0);
//    $bot->reply('');
//    $keyboard = [
//        ['Якунлаш'],
//    ];
//    $bot->typesAndWaits(0);
//
//    $bot->reply("Сизда ушбу йўналишга оид қандайдир маълумот (видео/аудио/фото/в.х.) бўлса, илова қилган ҳолда бизга юборишингиз мумкин!", ['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//
//$botman->hears('Мехнат интизоми бўйича', function($bot){
//    $bot->typesAndWaits(0);
//    $bot->reply('');
//    $keyboard = [
//        ['Якунлаш'],
//    ];
//    $bot->typesAndWaits(0);
//
//    $bot->reply("Сизда ушбу йўналишга оид қандайдир маълумот (видео/аудио/фото/в.х.) бўлса, илова қилган ҳолда бизга юборишингиз мумкин!", ['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//
//$botman->hears('Молия-ҳўжалик фаолияти бўйича', function($bot){
//    $bot->typesAndWaits(0);
//    $bot->reply('');
//    $keyboard = [
//        ['Якунлаш'],
//    ];
//    $bot->typesAndWaits(0);
//
//    $bot->reply("Сизда ушбу йўналишга оид қандайдир маълумот (видео/аудио/фото/в.х.) бўлса, илова қилган ҳолда бизга юборишингиз мумкин!", ['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//
//$botman->hears('Давлат харидлари бўйича (товарлар, ишлар ва хизматларни харид қилиш)', function($bot){
//    $bot->typesAndWaits(0);
//    $bot->reply('');
//    $keyboard = [
//        ['Якунлаш'],
//    ];
//    $bot->typesAndWaits(0);
//
//    $bot->reply("Сизда ушбу йўналишга оид қандайдир маълумот (видео/аудио/фото/в.х.) бўлса, илова қилган ҳолда бизга юборишингиз мумкин!", ['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//
//$botman->hears('Мурожатларни кўриб чиқиш ва ижро интизоми бўйича', function($bot){
//    $bot->typesAndWaits(0);
//    $bot->reply('');
//    $keyboard = [
//        ['Якунлаш'],
//    ];
//    $bot->typesAndWaits(0);
//
//    $bot->reply("Сизда ушбу йўналишга оид қандайдир маълумот (видео/аудио/фото/в.х.) бўлса, илова қилган ҳолда бизга юборишингиз мумкин!", ['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//
//$botman->hears('Бошка йуналишларда', function($bot){
//    $bot->typesAndWaits(0);
//    $bot->reply('');
//    $keyboard = [
//        ['Якунлаш'],
//    ];
//    $bot->typesAndWaits(0);
//
//    $bot->reply("Сизда ушбу йўналишга оид қандайдир маълумот (видео/аудио/фото/в.х.) бўлса, илова қилган ҳолда бизга юборишингиз мумкин!", ['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//
//$botman->hears('(.*.*)', function($bot){
//    $bot->typesAndWaits(0);
//    $bot->reply('');
//    if($bot)
//    $keyboard = [
//        ['📩Хабар юбориш.'],
//    ];
//    $bot->typesAndWaits(0);
//
//    $bot->reply("✅Юборган хабарингиз белгиланган тартибда кўриб чиқилади. Маълумот учун рахмат!", ['reply_markup' => json_encode([
//        'keyboard' => $keyboard,
//        'one_time_keyboard' => true,
//        'resize_keyboard' => true
//    ])]);
//});
//});